
MAIN_MENU = (
    '\nВарианты действий:'
    '\n1 - Погода в моем местоположении '
    '\n2 - Погода в городе '
    '\n3 - История запросов '
    '\n4 - Удаление всех запросов из истории '
    '\n5 - Выход'
)
OPTIONS = '\nВведите действие (1, 2, 3, 4, 5): '
ENTER_CITY = '\nВведите город: '
NUMBER_OF_REQUEST = '\nВведите сколько последних записей вывести: '
EXIT = '\nВыход из программы '
ALL_REMOVED = '\nВсе запросы из истории удалены '
PRINTED_ALL_REQUESTS = '\nВыведены все хранимые записи: '


SEPARATION_LINE = '\n------------------------------------------- '
CURRENT_TIME = '\nТекущее время: '
CITY_NAME = '\nНазвание города: '
WEATHER_CONDITIONS = '\nПогодные условия: '
TEMPERATURE = '\nТекущая температура: '
TEMPERATURE_FEELS_LIKE = '\nОщущается как: '
WIND_SPEED = '\nСкорость ветра: '
CELSIUS = ' градусов по цельсию'
MS = ' м/с'


INCORRECT_MAIN_MENU_ENTRY = '\n<<< Некорректный ввод, попробуйте ещё раз >>> '
# LAST_REQUEST_NUMBER_ENTRY = '\n<<< Необходимо вводить только целое число больше нуля, попробуйте ещё раз  >>> '
ValueError_TEXT = '\n<<< Необходимо вводить только целое число больше нуля, попробуйте ещё раз >>> '
SaveStorageError_TEXT = '\n<<< Не получилось сохранить данные >>> '
OpenStorageError_TEXT = '\n<<< Не получилось открыть файл истории запросов >>> '
GeocoderError_TEXT = '\n<<< Ошибка при получении данных о вашем местоположении >>> '
MissCityError_TEXT = '\n<<< Введенный город не найден, попробуйте ещё раз >>> '
ApiRequestError_TEXT = '\n<<< Проблемы с получением ответа от сервера >>> '
TypeError_TEXT = '\n<<< Ошибка с типом данных >>> '
TypeMenuError_TEXT = '\n<<< Некорректный ввод, попробуйте ещё раз >>> '
LostConnectionError_TEXT = '\n<<< Ошибка соединения, попробуйте позже >>> '
ExceptionError_TEXT = '\n<<< Неизвестная ошибка, попробуйте позже >>> '
TimeOutError_TEXT = '\n<<< Превышено время ожидания от сервера, попробуйте позже >>> '
DatabaseException_TEXT = "У нас пролемы в работе с базами данных. Уже решаем их!"
